{"apple": 0, "10": 1, "fy2023": 2, "document": 3, "aapl": 4, "20230930": 5, "false": 6, "2023": 7, "fy": 8, "0000320193": 9, "p1y": 10, "67": 11, "25": 12, "http": 13, "fasb": 14, "org": 15, "us": 16, "gaap": 17, "marketablesecuritiescurrent": 18, "marketablesecuritiesnoncurrent": 19, "longtermdebtcurrent": 20, "longtermdebtnoncurrent": 21, "otherassetsnoncurrent": 22, "propertyplantandequipmentnet": 23, "otherliabilitiescurrent": 24, "otherliabilitiesnoncurrent": 25, "p412d": 26, "p473d": 27, "2022": 28, "09": 29, "30": 30, "commonstockmember": 31, "a1": 32, "375notesdue2024member": 33, "a0": 34, "000notesdue2025member": 35, "875notesdue2025member": 36, "625notesdue2026member": 37, "a2": 38, "000notesdue2027member": 39, "375notesdue2029member": 40, "a3": 41, "050notesdue2029member": 42, "500notesdue2031member": 43, "600notesdue2042member": 44, "03": 45, "31": 46, "iso4217": 47, "usd": 48, "20": 49, "xbrli": 50, "shares": 51, "productmember": 52, "2021": 53, "26": 54, "24": 55, "2020": 56, "27": 57, "servicemember": 58, "commonstockincludingadditionalpaidincapitalmember": 59, "retainedearningsmember": 60, "accumulatedothercomprehensiveincomemember": 61, "performanceobligation": 62, "iphonemember": 63, "macmember": 64, "ipadmember": 65, "wearableshomeandaccessoriesmember": 66, "01": 67, "pure": 68, "2024": 69, "29": 70, "2025": 71, "28": 72, "2026": 73, "restrictedstockunitsrsumember": 74, "cashmember": 75, "moneymarketfundsmember": 76, "fairvalueinputslevel1member": 77, "equitysecuritiesmember": 78, "fairvalueinputslevel2member": 79, "ustreasurysecuritiesmember": 80, "usgovernmentagenciesdebtsecuritiesmember": 81, "foreigngovernmentdebtsecuritiesmember": 82, "banktimedepositsmember": 83, "commercialpapermember": 84, "corporatedebtsecuritiesmember": 85, "usstatesandpoliticalsubdivisionsmember": 86, "assetbackedsecuritiesmember": 87, "mutualfundmember": 88, "foreignexchangecontractmember": 89, "crosscurrencyinterestratecontractmember": 90, "designatedashedginginstrumentmember": 91, "interestratecontractmember": 92, "nondesignatedmember": 93, "otherassetsmember": 94, "creditconcentrationriskmember": 95, "otherliabilitiesmember": 96, "tradeaccountsreceivablemember": 97, "customer": 98, "customeronemember": 99, "cellularnetworkcarriersmember": 100, "nontradereceivablemember": 101, "vendor": 102, "vendoronemember": 103, "vendortwomember": 104, "landandbuildingmember": 105, "machineryequipmentandinternalusesoftwaremember": 106, "leaseholdimprovementsmember": 107, "unfavorableinvestigationoutcomeeustateaidrulesmember": 108, "2016": 109, "08": 110, "subsidiary": 111, "eur": 112, "unfavorableinvestigationoutcomeeustateaidrulesinterestcomponentmember": 113, "srt": 114, "minimummember": 115, "maximummember": 116, "a20132022debtissuancesmember": 117, "fixedratenotesmember": 118, "thirdquarter2023debtissuancemember": 119, "employeestockplan2022planmember": 120, "04": 121, "americassegmentmember": 122, "europesegmentmember": 123, "greaterchinasegmentmember": 124, "japansegmentmember": 125, "restofasiapacificsegmentmember": 126, "operatingsegmentsmember": 127, "materialreconcilingitemsmember": 128, "corporatenonsegmentmember": 129, "country": 130, "cn": 131, "othercountriesmember": 132, "deirdreobrienmember": 133, "jeffwilliamsmember": 134, "07": 135, "02": 136, "united": 137, "states": 138, "securities": 139, "exchange": 140, "commission": 141, "washington": 142, "20549": 143, "form": 144, "mark": 145, "one": 146, "annual": 147, "report": 148, "pursuant": 149, "section": 150, "13": 151, "15": 152, "act": 153, "1934": 154, "fiscal": 155, "year": 156, "ended": 157, "september": 158, "transition": 159, "period": 160, "from": 161, "file": 162, "number": 163, "001": 164, "36743": 165, "inc": 166, "exact": 167, "name": 168, "registrant": 169, "specified": 170, "its": 171, "charter": 172, "california": 173, "94": 174, "2404110": 175, "state": 176, "other": 177, "jurisdiction": 178, "incorporation": 179, "organization": 180, "employer": 181, "identification": 182, "park": 183, "way": 184, "cupertino": 185, "95014": 186, "address": 187, "principal": 188, "executive": 189, "offices": 190, "zip": 191, "code": 192, "408": 193, "996": 194, "1010": 195, "telephone": 196, "including": 197, "area": 198, "registered": 199, "12": 200, "title": 201, "each": 202, "class": 203, "trading": 204, "symbol": 205, "which": 206, "common": 207, "stock": 208, "00001": 209, "par": 210, "value": 211, "per": 212, "share": 213, "nasdaq": 214, "market": 215, "llc": 216, "375": 217, "notes": 218, "due": 219, "000": 220, "875": 221, "625": 222, "2027": 223, "2029": 224, "050": 225, "500": 226, "2031": 227, "600": 228, "2042": 229, "none": 230, "indicate": 231, "check": 232, "well": 233, "known": 234, "seasoned": 235, "issuer": 236, "defined": 237, "rule": 238, "405": 239, "yes": 240, "required": 241, "reports": 242, "whether": 243, "has": 244, "filed": 245, "all": 246, "during": 247, "preceding": 248, "months": 249, "shorter": 250, "been": 251, "subject": 252, "filing": 253, "requirements": 254, "past": 255, "90": 256, "days": 257, "submitted": 258, "electronically": 259, "every": 260, "interactive": 261, "data": 262, "regulation": 263, "232": 264, "chapter": 265, "submit": 266, "files": 267, "large": 268, "accelerated": 269, "filer": 270, "non": 271, "smaller": 272, "reporting": 273, "company": 274, "emerging": 275, "growth": 276, "see": 277, "definitions": 278, "12b": 279, "elected": 280, "use": 281, "extended": 282, "complying": 283, "any": 284, "new": 285, "revised": 286, "financial": 287, "accounting": 288, "standards": 289, "provided": 290, "attestation": 291, "management": 292, "assessment": 293, "effectiveness": 294, "internal": 295, "control": 296, "over": 297, "under": 298, "404": 299, "sarbanes": 300, "oxley": 301, "7262": 302, "public": 303, "firm": 304, "prepared": 305, "issued": 306, "audit": 307, "statements": 308, "included": 309, "reflect": 310, "correction": 311, "error": 312, "previously": 313, "those": 314, "corrections": 315, "restatements": 316, "recovery": 317, "analysis": 318, "incentive": 319, "based": 320, "compensation": 321, "received": 322, "officers": 323, "relevant": 324, "240": 325, "10d": 326, "shell": 327, "aggregate": 328, "voting": 329, "held": 330, "affiliates": 331, "march": 332, "last": 333, "business": 334, "day": 335, "most": 336, "recently": 337, "completed": 338, "second": 339, "quarter": 340, "approximately": 341, "591": 342, "165": 343, "solely": 344, "purposes": 345, "disclosure": 346, "directors": 347, "date": 348, "have": 349, "excluded": 350, "because": 351, "persons": 352, "may": 353, "deemed": 354, "determination": 355, "necessarily": 356, "conclusive": 357, "552": 358, "752": 359, "were": 360, "outstanding": 361, "october": 362, "documents": 363, "incorporated": 364, "reference": 365, "portions": 366, "definitive": 367, "proxy": 368, "statement": 369, "relating": 370, "meeting": 371, "shareholders": 372, "part": 373, "iii": 374, "where": 375, "indicated": 376, "within": 377, "120": 378, "after": 379, "end": 380, "relates": 381, "table": 382, "contents": 383, "page": 384, "item": 385, "1a": 386, "risk": 387, "factors": 388, "1b": 389, "unresolved": 390, "staff": 391, "comments": 392, "16": 393, "1c": 394, "ybersecurity": 395, "properties": 396, "17": 397, "ors": 398, "legal": 399, "proceedings": 400, "mine": 401, "safety": 402, "disclosures": 403, "ii": 404, "equity": 405, "related": 406, "stockholder": 407, "matters": 408, "purchases": 409, "18": 410, "reserved": 411, "19": 412, "discussion": 413, "condition": 414, "results": 415, "operations": 416, "7a": 417, "quantitative": 418, "qualitative": 419, "about": 420, "supplementary": 421, "changes": 422, "disagreements": 423, "accountants": 424, "52": 425, "9a": 426, "controls": 427, "procedures": 428, "9b": 429, "information": 430, "53": 431, "9c": 432, "regarding": 433, "foreign": 434, "jurisdictions": 435, "prevent": 436, "inspections": 437, "corporate": 438, "governance": 439, "11": 440, "security": 441, "ownership": 442, "certain": 443, "beneficial": 444, "owners": 445, "relationships": 446, "transactions": 447, "director": 448, "independence": 449, "14": 450, "accountant": 451, "fees": 452, "services": 453, "iv": 454, "exhibit": 455, "schedules": 456, "54": 457, "summary": 458, "57": 459, "contains": 460, "forward": 461, "looking": 462, "meaning": 463, "private": 464, "litigation": 465, "reform": 466, "1995": 467, "involve": 468, "risks": 469, "uncertainties": 470, "aning": 471, "many": 472, "located": 473, "heading": 474, "provide": 475, "current": 476, "expectations": 477, "future": 478, "events": 479, "assumptions": 480, "include": 481, "does": 482, "directly": 483, "relate": 484, "historical": 485, "fact": 486, "example": 487, "potential": 488, "impact": 489, "macroeconomic": 490, "conditions": 491, "can": 492, "also": 493, "identified": 494, "words": 495, "anticipates": 496, "believes": 497, "estimates": 498, "expects": 499, "intends": 500, "plans": 501, "predicts": 502, "would": 503, "could": 504, "similar": 505, "terms": 506, "guarantees": 507, "performance": 508, "actual": 509, "differ": 510, "significantly": 511, "discussed": 512, "might": 513, "cause": 514, "differences": 515, "limited": 516, "assumes": 517, "obligation": 518, "revise": 519, "update": 520, "reason": 521, "except": 522, "law": 523, "gation": 524, "unless": 525, "otherwise": 526, "stated": 527, "presented": 528, "herein": 529, "calendar": 530, "references": 531, "particular": 532, "years": 533, "quarters": 534, "periods": 535, "refer": 536, "associated": 537, "used": 538, "refers": 539, "collectively": 540, "wholly": 541, "owned": 542, "subsidiaries": 543, "background": 544, "designs": 545, "manufactures": 546, "markets": 547, "smartphones": 548, "personal": 549, "computers": 550, "tablets": 551, "wearables": 552, "accessories": 553, "sells": 554, "variety": 555, "week": 556, "ends": 557, "saturday": 558, "products": 559, "iphone": 560, "line": 561, "ios": 562, "operating": 563, "system": 564, "includes": 565, "pro": 566, "se": 567, "mac": 568, "macos": 569, "laptops": 570, "macbook": 571, "air": 572, "desktops": 573, "imac": 574, "mini": 575, "studio": 576, "ipad": 577, "multipurpose": 578, "ipados": 579, "home": 580, "smartwatches": 581, "wireless": 582, "headphones": 583, "ad": 584, "watchos": 585, "watch": 586, "ultra": 587, "series": 588, "airpods": 589, "max": 590, "beats": 591, "tv": 592, "media": 593, "streaming": 594, "gaming": 595, "device": 596, "tvos": 597, "homepod": 598, "high": 599, "fidelity": 600, "smart": 601, "speakers": 602, "branded": 603, "third": 604, "party": 605, "advertising": 606, "licensing": 607, "arrangements": 608, "own": 609, "platforms": 610, "applecare": 611, "offers": 612, "portfolio": 613, "fee": 614, "service": 615, "support": 616, "brand": 617, "offerings": 618, "priority": 619, "access": 620, "technical": 621, "global": 622, "authorized": 623, "network": 624, "repair": 625, "replacement": 626, "cases": 627, "additional": 628, "coverage": 629, "instances": 630, "accidental": 631, "damage": 632, "theft": 633, "loss": 634, "depending": 635, "type": 636, "product": 637, "cloud": 638, "store": 639, "keep": 640, "customers": 641, "content": 642, "up": 643, "available": 644, "across": 645, "multiple": 646, "devices": 647, "windows": 648, "digital": 649, "operates": 650, "various": 651, "app": 652, "allow": 653, "discover": 654, "download": 655, "applications": 656, "books": 657, "music": 658, "video": 659, "games": 660, "podcasts": 661, "through": 662, "subscription": 663, "arcade": 664, "game": 665, "fitness": 666, "sm": 667, "personalized": 668, "users": 669, "curated": 670, "listening": 671, "experience": 672, "demand": 673, "radio": 674, "stations": 675, "news": 676, "magazine": 677, "exclusive": 678, "original": 679, "live": 680, "sports": 681, "payment": 682, "card": 683, "co": 684, "credit": 685, "pay": 686, "cashless": 687, "segments": 688, "manages": 689, "primarily": 690, "geographic": 691, "basis": 692, "reportable": 693, "consist": 694, "americas": 695, "europe": 696, "greater": 697, "china": 698, "japan": 699, "rest": 700, "asia": 701, "pacific": 702, "both": 703, "north": 704, "south": 705, "america": 706, "european": 707, "countries": 708, "india": 709, "middle": 710, "east": 711, "africa": 712, "mainland": 713, "hong": 714, "kong": 715, "taiwan": 716, "australia": 717, "asian": 718, "although": 719, "hardware": 720, "software": 721, "managed": 722, "separately": 723, "better": 724, "align": 725, "location": 726, "distribution": 727, "partners": 728, "unique": 729, "dynamics": 730, "region": 731, "pany": 732, "consumer": 733, "small": 734, "mid": 735, "sized": 736, "education": 737, "enterprise": 738, "government": 739, "resells": 740, "major": 741, "retail": 742, "online": 743, "stores": 744, "direct": 745, "sales": 746, "force": 747, "employs": 748, "indirect": 749, "channels": 750, "cellular": 751, "carriers": 752, "wholesalers": 753, "retailers": 754, "resellers": 755, "net": 756, "accounted": 757, "37": 758, "63": 759, "respectively": 760, "total": 761, "competition": 762, "highly": 763, "competitive": 764, "characterized": 765, "aggressive": 766, "price": 767, "resulting": 768, "downward": 769, "pressure": 770, "gross": 771, "margins": 772, "frequent": 773, "introduction": 774, "short": 775, "life": 776, "cycles": 777, "evolving": 778, "industry": 779, "continual": 780, "improvement": 781, "characteristics": 782, "rapid": 783, "adoption": 784, "technological": 785, "advancements": 786, "competitors": 787, "sensitivity": 788, "consumers": 789, "businesses": 790, "seek": 791, "compete": 792, "pricing": 793, "very": 794, "low": 795, "cost": 796, "structures": 797, "imitating": 798, "infringing": 799, "intellectual": 800, "property": 801, "res": 802, "ability": 803, "successfully": 804, "depends": 805, "heavily": 806, "ensuring": 807, "continuing": 808, "timely": 809, "innovative": 810, "technologies": 811, "marketplace": 812, "develops": 813, "nearly": 814, "entire": 815, "solution": 816, "numerous": 817, "important": 818, "features": 819, "relative": 820, "quality": 821, "reliability": 822, "design": 823, "innovation": 824, "strong": 825, "ecosystem": 826, "marketing": 827, "capability": 828, "reputation": 829, "focused": 830, "expanding": 831, "opportunities": 832, "faces": 833, "substantial": 834, "companies": 835, "significant": 836, "resources": 837, "established": 838, "bases": 839, "addition": 840, "some": 841, "broader": 842, "lines": 843, "lower": 844, "priced": 845, "larger": 846, "installed": 847, "base": 848, "active": 849, "particularly": 850, "intense": 851, "aggressively": 852, "cut": 853, "prices": 854, "lowered": 855, "little": 856, "profit": 857, "even": 858, "models": 859, "free": 860, "illegitimate": 861, "means": 862, "obtain": 863, "imitate": 864, "collaborate": 865, "offer": 866, "integrated": 867, "solutions": 868, "more": 869, "than": 870, "currently": 871, "supply": 872, "components": 873, "essential": 874, "generally": 875, "sources": 876, "obtained": 877, "single": 878, "competes": 879, "participants": 880, "therefore": 881, "times": 882, "wide": 883, "shortage": 884, "commodity": 885, "fluctuations": 886, "uses": 887, "custom": 888, "commonly": 889, "introduced": 890, "often": 891, "utilize": 892, "only": 893, "source": 894, "when": 895, "component": 896, "initial": 897, "capacity": 898, "constraints": 899, "exist": 900, "until": 901, "suppliers": 902, "yields": 903, "matured": 904, "manufacturing": 905, "capacities": 906, "increased": 907, "continued": 908, "availability": 909, "acceptable": 910, "affected": 911, "decide": 912, "concentrate": 913, "production": 914, "instead": 915, "customized": 916, "meet": 917, "entered": 918, "agreements": 919, "however": 920, "guarantee": 921, "able": 922, "extend": 923, "renew": 924, "research": 925, "development": 926, "industries": 927, "advances": 928, "upon": 929, "ensure": 930, "flow": 931, "continues": 932, "develop": 933, "enhance": 934, "existing": 935, "expand": 936, "range": 937, "acquisition": 938, "technology": 939, "holds": 940, "broad": 941, "collection": 942, "rights": 943, "aspects": 944, "patents": 945, "copyrights": 946, "trademarks": 947, "forms": 948, "rademarks": 949, "factor": 950, "differentiating": 951, "success": 952, "depend": 953, "relies": 954, "skills": 955, "competence": 956, "abilities": 957, "personnel": 958, "regularly": 959, "patent": 960, "copyright": 961, "trademark": 962, "protect": 963, "innovations": 964, "arising": 965, "pursuing": 966, "thousands": 967, "around": 968, "world": 969, "time": 970, "accumulated": 971, "right": 972, "responsible": 973, "protecting": 974, "duration": 975, "adequate": 976, "expected": 977, "lives": 978, "designed": 979, "parties": 980, "necessary": 981, "licenses": 982, "processes": 983, "while": 984, "commercially": 985, "reasonable": 986, "arantee": 987, "seasonality": 988, "introductions": 989, "historically": 990, "experienced": 991, "higher": 992, "first": 993, "compared": 994, "seasonal": 995, "holiday": 996, "additionally": 997, "expenses": 998, "timing": 999, "filled": 1000, "inventory": 1001, "following": 1002, "launch": 1003, "channel": 1004, "older": 1005, "declines": 1006, "newer": 1007, "approaches": 1008, "distributors": 1009, "anticipate": 1010, "human": 1011, "capital": 1012, "talented": 1013, "motivated": 1014, "dedicated": 1015, "team": 1016, "works": 1017, "create": 1018, "inclusive": 1019, "safe": 1020, "supportive": 1021, "environment": 1022, "members": 1023, "had": 1024, "161": 1025, "full": 1026, "equivalent": 1027, "employees": 1028, "workplace": 1029, "practices": 1030, "policies": 1031, "equal": 1032, "opportunity": 1033, "committed": 1034, "inclusion": 1035, "diversity": 1036, "providing": 1037, "harassment": 1038, "discrimination": 1039, "benefits": 1040, "should": 1041, "equitable": 1042, "enable": 1043, "recognizes": 1044, "people": 1045, "likely": 1046, "thrive": 1047, "needs": 1048, "succeed": 1049, "professional": 1050, "invests": 1051, "tools": 1052, "individual": 1053, "vision": 1054, "build": 1055, "sustain": 1056, "workforce": 1057, "representative": 1058, "communities": 1059, "serves": 1060, "work": 1061, "increase": 1062, "diverse": 1063, "representation": 1064, "level": 1065, "foster": 1066, "culture": 1067, "engagement": 1068, "open": 1069, "honest": 1070, "communication": 1071, "among": 1072, "managers": 1073, "leaders": 1074, "helps": 1075, "collaborative": 1076, "everyone": 1077, "contribute": 1078, "grow": 1079, "encouraged": 1080, "come": 1081, "questions": 1082, "feedback": 1083, "concerns": 1084, "conducts": 1085, "surveys": 1086, "gauge": 1087, "employee": 1088, "sentiment": 1089, "areas": 1090, "like": 1091, "career": 1092, "manager": 1093, "inclusivity": 1094, "health": 1095, "everywhere": 1096, "identifies": 1097, "order": 1098, "measures": 1099, "mitigate": 1100, "possible": 1101, "hazards": 1102, "supports": 1103, "general": 1104, "crisis": 1105, "training": 1106, "putting": 1107, "specific": 1108, "programs": 1109, "place": 1110, "working": 1111, "potentially": 1112, "hazard": 1113, "environments": 1114, "visitors": 1115, "quarterly": 1116, "amendments": 1117, "sections": 1118, "amended": 1119, "sec": 1120, "charge": 1121, "investor": 1122, "com": 1123, "relations": 1124, "filings": 1125, "default": 1126, "aspx": 1127, "website": 1128, "periodically": 1129, "provides": 1130, "investors": 1131, "www": 1132, "press": 1133, "releases": 1134, "environmental": 1135, "social": 1136, "details": 1137, "contained": 1138, "websites": 1139, "referenced": 1140, "further": 1141, "urls": 1142, "intended": 1143, "inactive": 1144, "textual": 1145, "rther": 1146, "unknown": 1147, "described": 1148, "below": 1149, "materialize": 1150, "materially": 1151, "adversely": 1152, "affecting": 1153, "considered": 1154, "reliable": 1155, "indicator": 1156, "trends": 1157, "read": 1158, "conjunction": 1159, "consolidated": 1160, "accompanying": 1161, "regional": 1162, "economic": 1163, "adverse": 1164, "affect": 1165, "international": 1166, "outside": 1167, "representing": 1168, "majority": 1169, "chain": 1170, "complex": 1171, "supplier": 1172, "facilities": 1173, "assembly": 1174, "sites": 1175, "result": 1176, "slow": 1177, "recession": 1178, "unemployment": 1179, "inflation": 1180, "tighter": 1181, "interest": 1182, "rates": 1183, "currency": 1184, "confidence": 1185, "spending": 1186, "response": 1187, "monetary": 1188, "policy": 1189, "volatility": 1190, "income": 1191, "asset": 1192, "values": 1193, "uncertainty": 1194, "decline": 1195, "contract": 1196, "manufacturers": 1197, "logistics": 1198, "providers": 1199, "developers": 1200, "outcomes": 1201, "instability": 1202, "inability": 1203, "finance": 1204, "insolvency": 1205, "de": 1206, "lead": 1207, "collectibility": 1208, "trade": 1209, "receivables": 1210, "failure": 1211, "derivative": 1212, "counterparties": 1213, "institutions": 1214, "limitations": 1215, "issue": 1216, "debt": 1217, "reduced": 1218, "liquidity": 1219, "fair": 1220, "instruments": 1221, "impacts": 1222, "impacted": 1223, "political": 1224, "disputes": 1225, "war": 1226, "terrorism": 1227, "natural": 1228, "disasters": 1229, "issues": 1230, "industrial": 1231, "accidents": 1232, "interruptions": 1233, "harm": 1234, "disrupt": 1235, "commerce": 1236, "economy": 1237, "material": 1238, "effect": 1239, "substantially": 1240, "performed": 1241, "whole": 1242, "outsourcing": 1243, "korea": 1244, "vietnam": 1245, "restrictions": 1246, "tariffs": 1247, "imports": 1248, "exports": 1249, "goods": 1250, "limit": 1251, "distribute": 1252, "restrictive": 1253, "apply": 1254, "regions": 1255, "derives": 1256, "portion": 1257, "revenues": 1258, "require": 1259, "take": 1260, "actions": 1261, "changing": 1262, "restructuring": 1263, "ceasing": 1264, "accordance": 1265, "changed": 1266, "expensive": 1267, "consuming": 1268, "disruptive": 1269, "announced": 1270, "advance": 1271, "notice": 1272, "effectively": 1273, "tensions": 1274, "between": 1275, "governments": 1276, "led": 1277, "being": 1278, "imposed": 1279, "ina": 1280, "conflicts": 1281, "escalate": 1282, "severe": 1283, "surrounding": 1284, "negative": 1285, "critical": 1286, "locations": 1287, "prone": 1288, "earthquakes": 1289, "interruption": 1290, "fire": 1291, "power": 1292, "shortages": 1293, "nuclear": 1294, "plant": 1295, "terrorist": 1296, "attacks": 1297, "hostile": 1298, "acts": 1299, "ransomware": 1300, "cybersecurity": 1301, "labor": 1302, "pandemics": 1303, "covid": 1304, "pandemic": 1305, "beyond": 1306, "climate": 1307, "change": 1308, "types": 1309, "droughts": 1310, "floods": 1311, "hurricanes": 1312, "wildfires": 1313, "occurring": 1314, "frequently": 1315, "effects": 1316, "make": 1317, "difficult": 1318, "impossible": 1319, "manufacture": 1320, "deliver": 1321, "delays": 1322, "inefficiencies": 1323, "slowdowns": 1324, "outages": 1325, "negatively": 1326, "expenditures": 1327, "resume": 1328, "lose": 1329, "exacerbate": 1330, "consequences": 1331, "maintain": 1332, "accident": 1333, "occur": 1334, "serious": 1335, "injuries": 1336, "disruption": 1337, "njuries": 1338, "imposition": 1339, "protective": 1340, "stringent": 1341, "travel": 1342, "freight": 1343, "movement": 1344, "disruptions": 1345, "offering": 1346, "ramps": 1347, "maintains": 1348, "insurance": 1349, "losses": 1350, "insufficient": 1351, "cover": 1352, "arise": 1353, "unable": 1354, "offered": 1355, "must": 1356, "investments": 1357, "assurance": 1358, "achieve": 1359, "returns": 1360, "applied": 1361, "register": 1362, "pyrights": 1363, "contrast": 1364, "effective": 1365, "protection": 1366, "consistently": 1367, "continue": 1368, "sell": 1369, "attractive": 1370, "infringe": 1371, "advantage": 1372, "minority": 1373, "smartphone": 1374, "computer": 1375, "tablet": 1376, "contracted": 1377, "overall": 1378, "intensify": 1379, "approach": 1380, "seamlessly": 1381, "collaboratively": 1382, "face": 1383, "continually": 1384, "improve": 1385, "functional": 1386, "advantages": 1387, "remain": 1388, "stimulate": 1389, "manage": 1390, "transitions": 1391, "he": 1392, "volatile": 1393, "nature": 1394, "introduce": 1395, "upgraded": 1396, "successful": 1397, "acceptance": 1398, "ramp": 1399, "application": 1400, "purchase": 1401, "commitments": 1402, "levels": 1403, "anticipated": 1404, "appropriate": 1405, "quantities": 1406, "costs": 1407, "defects": 1408, "deficiencies": 1409, "logistical": 1410, "concentration": 1411, "additions": 1412, "considerable": 1413, "outsourced": 1414, "much": 1415, "transportation": 1416, "reduce": 1417, "diminished": 1418, "quantity": 1419, "manufactured": 1420, "flexibility": 1421, "respond": 1422, "contain": 1423, "provisions": 1424, "defect": 1425, "expense": 1426, "reimbursement": 1427, "remains": 1428, "warranty": 1429, "out": 1430, "event": 1431, "experiences": 1432, "unanticipated": 1433, "liabilities": 1434, "adhere": 1435, "conduct": 1436, "violations": 1437, "final": 1438, "perform": 1439, "finished": 1440, "transit": 1441, "destinations": 1442, "disrupted": 1443, "reasons": 1444, "man": 1445, "made": 1446, "failures": 1447, "commercial": 1448, "armed": 1449, "conflict": 1450, "invested": 1451, "process": 1452, "equipment": 1453, "prepayments": 1454, "long": 1455, "term": 1456, "help": 1457, "problems": 1458, "terminated": 1459, "recoverability": 1460, "sufficient": 1461, "obtains": 1462, "semiconductor": 1463, "suffer": 1464, "poor": 1465, "consolidation": 1466, "limiting": 1467, "above": 1468, "increases": 1469, "delayed": 1470, "constrained": 1471, "partner": 1472, "shipments": 1473, "identify": 1474, "alternative": 1475, "sophisticated": 1476, "unexpectedly": 1477, "interfere": 1478, "operation": 1479, "unsafe": 1480, "injury": 1481, "specialized": 1482, "errors": 1483, "detect": 1484, "fix": 1485, "do": 1486, "so": 1487, "widespread": 1488, "exposed": 1489, "liability": 1490, "claims": 1491, "recalls": 1492, "replacements": 1493, "modifications": 1494, "write": 1495, "offs": 1496, "intangible": 1497, "assets": 1498, "regulatory": 1499, "fines": 1500, "delay": 1501, "lost": 1502, "downs": 1503, "commitment": 1504, "cancellation": 1505, "records": 1506, "down": 1507, "inventories": 1508, "become": 1509, "obsolete": 1510, "exceed": 1511, "exceeds": 1512, "realizable": 1513, "accrues": 1514, "reserves": 1515, "orders": 1516, "excess": 1517, "reviews": 1518, "lived": 1519, "impairment": 1520, "whenever": 1521, "circumstances": 1522, "recoverable": 1523, "determines": 1524, "occurred": 1525, "amount": 1526, "carrying": 1527, "incur": 1528, "impairments": 1529, "charges": 1530, "given": 1531, "unpredictable": 1532, "pace": 1533, "obsolescence": 1534, "builds": 1535, "announcements": 1536, "obligations": 1537, "forecasted": 1538, "typically": 1539, "150": 1540, "forecast": 1541, "incorrectly": 1542, "produce": 1543, "amounts": 1544, "fully": 1545, "requires": 1546, "extensive": 1547, "rate": 1548, "issuance": 1549, "unknowingly": 1550, "others": 1551, "notified": 1552, "practice": 1553, "preclude": 1554, "selling": 1555, "decisions": 1556, "cease": 1557, "developed": 1558, "maintained": 1559, "choose": 1560, "buy": 1561, "perception": 1562, "developing": 1563, "maintaining": 1564, "upgrading": 1565, "android": 1566, "playstation": 1567, "nintendo": 1568, "xbox": 1569, "position": 1570, "revenue": 1571, "generated": 1572, "less": 1573, "inclined": 1574, "upgrade": 1575, "devote": 1576, "focus": 1577, "efforts": 1578, "competing": 1579, "compelling": 1580, "systems": 1581, "fail": 1582, "improved": 1583, "operate": 1584, "dissatisfied": 1585, "distributes": 1586, "vast": 1587, "generate": 1588, "retains": 1589, "initiated": 1590, "taken": 1591, "legislative": 1592, "initiatives": 1593, "impacting": 1594, "union": 1595, "eu": 1596, "comply": 1597, "investigations": 1598, "resulted": 1599, "how": 1600, "communicate": 1601, "purchasing": 1602, "mechanisms": 1603, "what": 1604, "apps": 1605, "extent": 1606, "allows": 1607, "inside": 1608, "volume": 1609, "earns": 1610, "decrease": 1611, "educe": 1612, "narrowed": 1613, "scope": 1614, "eliminated": 1615, "appeals": 1616, "contracts": 1617, "subscriptions": 1618, "incorporate": 1619, "relatively": 1620, "continuation": 1621, "renewal": 1622, "license": 1623, "rs": 1624, "usage": 1625, "rules": 1626, "produces": 1627, "costly": 1628, "increasing": 1629, "talent": 1630, "subscribers": 1631, "appeal": 1632, "manner": 1633, "largely": 1634, "talents": 1635, "skilled": 1636, "key": 1637, "nurture": 1638, "distinctive": 1639, "chief": 1640, "officer": 1641, "especially": 1642, "silicon": 1643, "valley": 1644, "nts": 1645, "constantly": 1646, "operational": 1647, "driver": 1648, "recruit": 1649, "retain": 1650, "who": 1651, "financing": 1652, "installment": 1653, "subsidies": 1654, "same": 1655, "invest": 1656, "reseller": 1657, "staffing": 1658, "selected": 1659, "contractors": 1660, "improving": 1661, "placement": 1662, "displays": 1663, "investment": 1664, "assuring": 1665, "return": 1666, "incremental": 1667, "weaken": 1668, "stop": 1669, "distributing": 1670, "ordering": 1671, "dependent": 1672, "caused": 1673, "telecommunications": 1674, "viruses": 1675, "physical": 1676, "electronic": 1677, "break": 1678, "ins": 1679, "incidents": 1680, "upgrades": 1681, "redundancy": 1682, "continuity": 1683, "ineffective": 1684, "inadequate": 1685, "vendors": 1686, "disaster": 1687, "planning": 1688, "eventualities": 1689, "things": 1690, "preventing": 1691, "interfering": 1692, "impeding": 1693, "shipping": 1694, "unauthorized": 1695, "confidential": 1696, "reputational": 1697, "respect": 1698, "devotes": 1699, "encryption": 1700, "cannot": 1701, "absolute": 1702, "malicious": 1703, "hat": 1704, "takes": 1705, "steps": 1706, "secure": 1707, "accessible": 1708, "behalf": 1709, "always": 1710, "attempts": 1711, "gain": 1712, "regular": 1713, "compromise": 1714, "confidentiality": 1715, "integrity": 1716, "normal": 1717, "impair": 1718, "attract": 1719, "expose": 1720, "penalties": 1721, "judgments": 1722, "against": 1723, "globally": 1724, "accelerating": 1725, "frequency": 1726, "sophistication": 1727, "actors": 1728, "techniques": 1729, "circumvent": 1730, "avoid": 1731, "detection": 1732, "remove": 1733, "obfuscate": 1734, "forensic": 1735, "evidence": 1736, "hinders": 1737, "investigate": 1738, "recover": 1739, "nce": 1740, "diplomatic": 1741, "perpetrated": 1742, "targeted": 1743, "profile": 1744, "creates": 1745, "owns": 1746, "implemented": 1747, "sensitive": 1748, "authentication": 1749, "vulnerable": 1750, "hacking": 1751, "malfeasance": 1752, "faulty": 1753, "password": 1754, "irregularities": 1755, "fraudulently": 1756, "induce": 1757, "disclosing": 1758, "usernames": 1759, "passwords": 1760, "turn": 1761, "deploys": 1762, "makes": 1763, "multifactor": 1764, "monitors": 1765, "unusual": 1766, "activity": 1767, "freeze": 1768, "accounts": 1769, "suspicious": 1770, "impede": 1771, "strategies": 1772, "acquisitions": 1773, "ongoing": 1774, "present": 1775, "originally": 1776, "contemplated": 1777, "endeavors": 1778, "distraction": 1779, "challenges": 1780, "tangible": 1781, "failing": 1782, "approvals": 1783, "onerous": 1784, "completing": 1785, "transaction": 1786, "realize": 1787, "ventures": 1788, "inherently": 1789, "risky": 1790, "pose": 1791, "construction": 1792, "leases": 1793, "compliance": 1794, "unfavorable": 1795, "ould": 1796, "arisen": 1797, "ordinary": 1798, "course": 1799, "yet": 1800, "resolved": 1801, "sometimes": 1802, "indemnification": 1803, "damages": 1804, "claim": 1805, "indemnified": 1806, "involving": 1807, "alleged": 1808, "magnitude": 1809, "faced": 1810, "enabled": 1811, "frameworks": 1812, "holding": 1813, "assert": 1814, "royalties": 1815, "enter": 1816, "allegations": 1817, "infringement": 1818, "vigorously": 1819, "defending": 1820, "courts": 1821, "several": 1822, "internationally": 1823, "plaintiffs": 1824, "injunctions": 1825, "ious": 1826, "regardless": 1827, "merit": 1828, "responding": 1829, "recognition": 1830, "considerations": 1831, "settle": 1832, "resolve": 1833, "note": 1834, "contingencies": 1835, "concentrations": 1836, "opinion": 1837, "least": 1838, "possibility": 1839, "incurred": 1840, "recorded": 1841, "accrual": 1842, "concerning": 1843, "asserted": 1844, "outcome": 1845, "uncertain": 1846, "al": 1847, "compensatory": 1848, "punitive": 1849, "trebled": 1850, "disgorgement": 1851, "profits": 1852, "remedial": 1853, "injunctive": 1854, "relief": 1855, "laws": 1856, "regulations": 1857, "worldwide": 1858, "exposes": 1859, "mpany": 1860, "subjects": 1861, "antitrust": 1862, "privacy": 1863, "localization": 1864, "billing": 1865, "machine": 1866, "learning": 1867, "artificial": 1868, "intelligence": 1869, "internet": 1870, "mobile": 1871, "communications": 1872, "television": 1873, "film": 1874, "employment": 1875, "anticorruption": 1876, "import": 1877, "export": 1878, "cash": 1879, "repatriation": 1880, "anti": 1881, "money": 1882, "laundering": 1883, "tax": 1884, "waste": 1885, "recycling": 1886, "feature": 1887, "imposing": 1888, "requiring": 1889, "interpreted": 1890, "ons": 1891, "applicable": 1892, "agents": 1893, "violate": 1894, "found": 1895, "violated": 1896, "satisfy": 1897, "violation": 1898, "banned": 1899, "prohibited": 1900, "importation": 1901, "regulators": 1902, "stakeholders": 1903, "increasingly": 1904, "greenhouse": 1905, "gas": 1906, "emissions": 1907, "civil": 1908, "goals": 1909, "implementation": 1910, "involves": 1911, "disagree": 1912, "perceived": 1913, "federal": 1914, "varied": 1915, "stakeholder": 1916, "scrutiny": 1917, "lopers": 1918, "individually": 1919, "findings": 1920, "ted": 1921, "search": 1922, "connection": 1923, "nd": 1924, "retention": 1925, "transfer": 1926, "restrict": 1927, "transfers": 1928, "passed": 1929, "considering": 1930, "pending": 1931, "inconsistent": 1932, "causes": 1933, "noncompliance": 1934, "notices": 1935, "inquiries": 1936, "governmental": 1937, "entities": 1938, "biometric": 1939, "breach": 1940, "notification": 1941, "authorities": 1942, "fails": 1943, "adequately": 1944, "handled": 1945, "permitted": 1946, "healthcare": 1947, "liable": 1948, "investigatory": 1949, "cardholder": 1950, "compromised": 1951, "follow": 1952, "nificant": 1953, "cards": 1954, "fluctuate": 1955, "vary": 1956, "pressures": 1957, "compressed": 1958, "acquiring": 1959, "delivering": 1960, "shifts": 1961, "mix": 1962, "modify": 1963, "generates": 1964, "unexpected": 1965, "developments": 1966, "dollar": 1967, "local": 1968, "currencies": 1969, "primary": 1970, "exposure": 1971, "movements": 1972, "denominated": 1973, "weakening": 1974, "affects": 1975, "earnings": 1976, "leads": 1977, "raise": 1978, "reducing": 1979, "offset": 1980, "strengthening": 1981, "conversely": 1982, "thereby": 1983, "benefit": 1984, "thus": 1985, "option": 1986, "hedge": 1987, "exposures": 1988, "hedging": 1989, "activities": 1990, "hedges": 1991, "deterioration": 1992, "sovereign": 1993, "equivalents": 1994, "marketable": 1995, "realized": 1996, "receivable": 1997, "heightened": 1998, "worsen": 1999, "vices": 2000, "covered": 2001, "collateral": 2002, "bank": 2003, "concentrated": 2004, "unsecured": 2005, "subassemblies": 2006, "assemble": 2007, "few": 2008, "monitor": 2009, "legislation": 2010, "taxes": 2011, "ireland": 2012, "singapore": 2013, "organized": 2014, "organisation": 2015, "proposals": 2016, "modernizing": 2017, "minimum": 2018, "differing": 2019, "statutory": 2020, "valuation": 2021, "deferred": 2022, "interpretation": 2023, "judgment": 2024, "interpretations": 2025, "examination": 2026, "bodies": 2027, "assesses": 2028, "likelihood": 2029, "examinations": 2030, "determine": 2031, "adequacy": 2032, "provision": 2033, "quacy": 2034, "ultimate": 2035, "owed": 2036, "accrued": 2037, "extreme": 2038, "ways": 2039, "unrelated": 2040, "average": 2041, "repurchases": 2042, "point": 2043, "profitability": 2044, "dividend": 2045, "repurchase": 2046, "program": 2047, "consummated": 2048, "dividends": 2049, "declaration": 2050, "board": 2051, "obligate": 2052, "acquire": 2053, "headquarters": 2054, "leased": 2055, "land": 2056, "functions": 2057, "centers": 2058, "throughout": 2059, "places": 2060, "good": 2061, "suitable": 2062, "epic": 2063, "lawsuit": 2064, "district": 2065, "court": 2066, "northern": 2067, "alleging": 2068, "unfair": 2069, "ruled": 2070, "favor": 2071, "nine": 2072, "ten": 2073, "counts": 2074, "review": 2075, "guidelines": 2076, "injunction": 2077, "enjoining": 2078, "prohibiting": 2079, "external": 2080, "links": 2081, "applies": 2082, "storefront": 2083, "april": 2084, "ninth": 2085, "circuit": 2086, "affirmed": 2087, "ruling": 2088, "june": 2089, "petitions": 2090, "requesting": 2091, "decision": 2092, "denied": 2093, "july": 2094, "granted": 2095, "motion": 2096, "stay": 2097, "enforcement": 2098, "supreme": 2099, "denies": 2100, "petition": 2101, "expire": 2102, "masimo": 2103, "corporation": 2104, "cercacor": 2105, "laboratories": 2106, "together": 2107, "complaint": 2108, "before": 2109, "itc": 2110, "five": 2111, "functionality": 2112, "blood": 2113, "oxygen": 2114, "sought": 2115, "permanent": 2116, "exclusion": 2117, "sensing": 2118, "go": 2119, "administrative": 2120, "december": 2121, "settled": 2122, "fourth": 2123, "did": 2124, "traded": 2125, "ecurities": 2126, "holders": 2127, "23": 2128, "763": 2129, "record": 2130, "affiliated": 2131, "purchasers": 2132, "three": 2133, "follows": 2134, "millions": 2135, "reflected": 2136, "purchased": 2137, "paid": 2138, "publicly": 2139, "approximate": 2140, "august": 2141, "privately": 2142, "negotiated": 2143, "33": 2144, "864": 2145, "191": 2146, "62": 2147, "asrs": 2148, "22": 2149, "085": 2150, "299": 2151, "178": 2152, "99": 2153, "347": 2154, "176": 2155, "106": 2156, "595": 2157, "74": 2158, "069": 2159, "billion": 2160, "utilized": 2161, "previous": 2162, "rized": 2163, "repurchased": 2164, "10b5": 2165, "two": 2166, "front": 2167, "payments": 2168, "totaling": 2169, "ultimately": 2170, "delivered": 2171, "determined": 2172, "weighted": 2173, "graph": 2174, "shows": 2175, "comparison": 2176, "cumulative": 2177, "shareholder": 2178, "calculated": 2179, "reinvested": 2180, "index": 2181, "dow": 2182, "jones": 2183, "supersector": 2184, "100": 2185, "close": 2186, "2018": 2187, "indicative": 2188, "2019": 2189, "98": 2190, "204": 2191, "269": 2192, "277": 2193, "317": 2194, "104": 2195, "118": 2196, "136": 2197, "160": 2198, "105": 2199, "154": 2200, "227": 2201, "164": 2202, "226": 2203, "discusses": 2204, "items": 2205, "comparisons": 2206, "discussions": 2207, "six": 2208, "realign": 2209, "spanned": 2210, "weeks": 2211, "whereas": 2212, "highlights": 2213, "383": 2214, "97": 2215, "ghts": 2216, "decreased": 2217, "weakness": 2218, "consisted": 2219, "partially": 2220, "announces": 2221, "next": 2222, "generation": 2223, "4k": 2224, "mls": 2225, "season": 2226, "pass": 2227, "league": 2228, "soccer": 2229, "spatial": 2230, "featuring": 2231, "visionos": 2232, "early": 2233, "sonoma": 2234, "updates": 2235, "plus": 2236, "raised": 2237, "beginning": 2238, "76": 2239, "indirectly": 2240, "segment": 2241, "dollars": 2242, "162": 2243, "560": 2244, "169": 2245, "658": 2246, "153": 2247, "306": 2248, "294": 2249, "95": 2250, "89": 2251, "307": 2252, "72": 2253, "559": 2254, "200": 2255, "68": 2256, "366": 2257, "257": 2258, "977": 2259, "482": 2260, "615": 2261, "356": 2262, "285": 2263, "394": 2264, "328": 2265, "365": 2266, "817": 2267, "824": 2268, "million": 2269, "ac": 2270, "renminbi": 2271, "yen": 2272, "er": 2273, "21": 2274, "category": 2275, "583": 2276, "205": 2277, "489": 2278, "973": 2279, "357": 2280, "40": 2281, "177": 2282, "35": 2283, "190": 2284, "300": 2285, "292": 2286, "862": 2287, "39": 2288, "845": 2289, "41": 2290, "241": 2291, "38": 2292, "367": 2293, "85": 2294, "78": 2295, "129": 2296, "425": 2297, "amortization": 2298, "unspecified": 2299, "bundled": 2300, "respective": 2301, "combined": 2302, "9th": 2303, "10th": 2304, "margin": 2305, "percentage": 2306, "108": 2307, "803": 2308, "114": 2309, "728": 2310, "126": 2311, "60": 2312, "345": 2313, "56": 2314, "054": 2315, "47": 2316, "710": 2317, "148": 2318, "170": 2319, "782": 2320, "152": 2321, "836": 2322, "36": 2323, "70": 2324, "71": 2325, "69": 2326, "44": 2327, "43": 2328, "savings": 2329, "different": 2330, "leverage": 2331, "gher": 2332, "915": 2333, "251": 2334, "914": 2335, "932": 2336, "094": 2337, "847": 2338, "51": 2339, "887": 2340, "driven": 2341, "headcount": 2342, "flat": 2343, "741": 2344, "527": 2345, "department": 2346, "treasury": 2347, "balances": 2348, "unrestricted": 2349, "totaled": 2350, "along": 2351, "ient": 2352, "contractual": 2353, "fixed": 2354, "varying": 2355, "maturities": 2356, "payable": 2357, "promissory": 2358, "paper": 2359, "lease": 2360, "center": 2361, "space": 2362, "utilizes": 2363, "testing": 2364, "noncancelable": 2365, "licensed": 2366, "balance": 2367, "cuts": 2368, "jobs": 2369, "2017": 2370, "preparation": 2371, "conformity": 2372, "ng": 2373, "accepted": 2374, "principles": 2375, "reported": 2376, "describes": 2377, "methods": 2378, "making": 2379, "positions": 2380, "evaluation": 2381, "domestic": 2382, "allocation": 2383, "taxation": 2384, "adjusted": 2385, "facts": 2386, "closing": 2387, "resolution": 2388, "probable": 2389, "reasonably": 2390, "estimable": 2391, "still": 2392, "portfolios": 2393, "sets": 2394, "forth": 2395, "derivatives": 2396, "hypothetical": 2397, "instrument": 2398, "points": 2399, "tenors": 2400, "089": 2401, "022": 2402, "194": 2403, "201": 2404, "receiver": 2405, "expressed": 2406, "adjust": 2407, "vative": 2408, "prohibitive": 2409, "var": 2410, "model": 2411, "assess": 2412, "monte": 2413, "carlo": 2414, "simulation": 2415, "maximum": 2416, "interval": 2417, "669": 2418, "underlying": 2419, "comprehensive": 2420, "sheets": 2421, "flows": 2422, "32": 2423, "independent": 2424, "49": 2425, "omitted": 2426, "since": 2427, "submission": 2428, "schedule": 2429, "298": 2430, "61": 2431, "computing": 2432, "basic": 2433, "744": 2434, "231": 2435, "919": 2436, "96": 2437, "995": 2438, "680": 2439, "translation": 2440, "765": 2441, "511": 2442, "501": 2443, "unrealized": 2444, "gains": 2445, "323": 2446, "adjustment": 2447, "717": 2448, "074": 2449, "003": 2450, "138": 2451, "035": 2452, "563": 2453, "694": 2454, "253": 2455, "273": 2456, "816": 2457, "899": 2458, "967": 2459, "343": 2460, "272": 2461, "569": 2462, "249": 2463, "965": 2464, "352": 2465, "755": 2466, "611": 2467, "302": 2468, "083": 2469, "50": 2470, "400": 2471, "550": 2472, "061": 2473, "943": 2474, "73": 2475, "812": 2476, "64": 2477, "849": 2478, "deficit": 2479, "214": 2480, "068": 2481, "452": 2482, "109": 2483, "146": 2484, "672": 2485, "65": 2486, "339": 2487, "withheld": 2488, "settlement": 2489, "awards": 2490, "521": 2491, "971": 2492, "627": 2493, "retained": 2494, "562": 2495, "declared": 2496, "793": 2497, "431": 2498, "099": 2499, "454": 2500, "151": 2501, "77": 2502, "046": 2503, "186": 2504, "502": 2505, "ending": 2506, "163": 2507, "406": 2508, "090": 2509, "rsu": 2510, "restricted": 2511, "adjustments": 2512, "reconcile": 2513, "depreciation": 2514, "519": 2515, "006": 2516, "921": 2517, "688": 2518, "823": 2519, "125": 2520, "271": 2521, "642": 2522, "684": 2523, "499": 2524, "042": 2525, "889": 2526, "448": 2527, "038": 2528, "investing": 2529, "513": 2530, "923": 2531, "558": 2532, "proceeds": 2533, "686": 2534, "59": 2535, "023": 2536, "828": 2537, "460": 2538, "959": 2539, "708": 2540, "337": 2541, "086": 2542, "385": 2543, "705": 2544, "354": 2545, "545": 2546, "223": 2547, "556": 2548, "025": 2549, "841": 2550, "467": 2551, "402": 2552, "228": 2553, "393": 2554, "repayments": 2555, "543": 2556, "750": 2557, "978": 2558, "955": 2559, "488": 2560, "110": 2561, "749": 2562, "93": 2563, "353": 2564, "760": 2565, "952": 2566, "860": 2567, "737": 2568, "929": 2569, "supplemental": 2570, "679": 2571, "687": 2572, "presentation": 2573, "prior": 2574, "reclassified": 2575, "conform": 2576, "collected": 2577, "remitted": 2578, "straight": 2579, "estimate": 2580, "vest": 2581, "sation": 2582, "liquid": 2583, "treated": 2584, "sold": 2585, "using": 2586, "method": 2587, "measured": 2588, "recognized": 2589, "presents": 2590, "created": 2591, "combines": 2592, "nonlease": 2593, "entitled": 2594, "transferred": 2595, "rewards": 2596, "shipped": 2597, "hipped": 2598, "commencement": 2599, "delivery": 2600, "reductions": 2601, "represent": 2602, "promises": 2603, "arrangement": 2604, "distinct": 2605, "allocates": 2606, "stand": 2607, "alone": 2608, "ssps": 2609, "observable": 2610, "best": 2611, "estimating": 2612, "without": 2613, "considers": 2614, "charged": 2615, "objectives": 2616, "estimated": 2617, "sale": 2618, "represents": 2619, "allocated": 2620, "receive": 2621, "icloud": 2622, "siri": 2623, "maps": 2624, "discounts": 2625, "lacks": 2626, "undelivered": 2627, "occurs": 2628, "bill": 2629, "unbilled": 2630, "consideration": 2631, "entirely": 2632, "accordingly": 2633, "disclose": 2634, "transferring": 2635, "billed": 2636, "determining": 2637, "evaluating": 2638, "establish": 2639, "responsibility": 2640, "acceptability": 2641, "recognizing": 2642, "34": 2643, "disaggregated": 2644, "proportion": 2645, "consistent": 2646, "represented": 2647, "moderately": 2648, "computation": 2649, "diluted": 2650, "numerator": 2651, "denominator": 2652, "units": 2653, "rsus": 2654, "antidilutive": 2655, "tables": 2656, "show": 2657, "359": 2658, "544": 2659, "546": 2660, "805": 2661, "measure": 2662, "ratings": 2663, "quoted": 2664, "valuations": 2665, "inputs": 2666, "derived": 2667, "corroborated": 2668, "aid": 2669, "maturity": 2670, "427": 2671, "classified": 2672, "classifies": 2673, "either": 2674, "hedged": 2675, "forwards": 2676, "options": 2677, "designate": 2678, "cross": 2679, "swaps": 2680, "designates": 2681, "length": 2682, "variability": 2683, "designated": 2684, "remeasurement": 2685, "notional": 2686, "730": 2687, "777": 2688, "185": 2689, "381": 2690, "sheet": 2691, "failed": 2692, "posted": 2693, "contractually": 2694, "thresholds": 2695, "master": 2696, "netting": 2697, "allowed": 2698, "set": 2699, "off": 2700, "reduction": 2701, "412": 2702, "433": 2703, "378": 2704, "247": 2705, "739": 2706, "rather": 2707, "48": 2708, "buildings": 2709, "446": 2710, "machinery": 2711, "314": 2712, "457": 2713, "884": 2714, "340": 2715, "715": 2716, "42": 2717, "117": 2718, "852": 2719, "428": 2720, "819": 2721, "142": 2722, "detail": 2723, "843": 2724, "933": 2725, "931": 2726, "645": 2727, "382": 2728, "565": 2729, "334": 2730, "258": 2731, "445": 2732, "644": 2733, "265": 2734, "801": 2735, "pretax": 2736, "reconciliation": 2737, "computed": 2738, "applying": 2739, "885": 2740, "212": 2741, "033": 2742, "871": 2743, "137": 2744, "deduction": 2745, "carryforwards": 2746, "206": 2747, "allowance": 2748, "374": 2749, "530": 2750, "369": 2751, "676": 2752, "179": 2753, "537": 2754, "carried": 2755, "indefinitely": 2756, "temporary": 2757, "unrecognized": 2758, "excludes": 2759, "758": 2760, "475": 2761, "044": 2762, "decreases": 2763, "463": 2764, "982": 2765, "628": 2766, "607": 2767, "settlements": 2768, "taxing": 2769, "838": 2770, "expiration": 2771, "statute": 2772, "494": 2773, "181": 2774, "477": 2775, "jurisd": 2776, "ictions": 2777, "2014": 2778, "altho": 2779, "ugh": 2780, "closure": 2781, "opinions": 2782, "1991": 2783, "2007": 2784, "irish": 2785, "branches": 2786, "ordered": 2787, "calculate": 2788, "2003": 2789, "january": 2790, "2015": 2791, "appealed": 2792, "justice": 2793, "annulled": 2794, "ecj": 2795, "hearing": 2796, "eligible": 2797, "request": 2798, "approval": 2799, "minister": 2800, "excluding": 2801, "funded": 2802, "escrow": 2803, "conclusion": 2804, "exceeding": 2805, "multiyear": 2806, "exercise": 2807, "variable": 2808, "output": 2809, "noncash": 2810, "rou": 2811, "661": 2812, "417": 2813, "015": 2814, "410": 2815, "411": 2816, "719": 2817, "266": 2818, "imputed": 2819, "401": 2820, "424": 2821, "818": 2822, "842": 2823, "remaining": 2824, "discount": 2825, "borrowing": 2826, "implicit": 2827, "readily": 2828, "commenced": 2829, "commence": 2830, "ranging": 2831, "mercial": 2832, "333": 2833, "264": 2834, "946": 2835, "567": 2836, "309": 2837, "379": 2838, "senior": 2839, "arrears": 2840, "2013": 2841, "issuances": 2842, "650": 2843, "2062": 2844, "101": 2845, "322": 2846, "850": 2847, "2053": 2848, "250": 2849, "111": 2850, "unamortized": 2851, "premium": 2852, "113": 2853, "363": 2854, "103": 2855, "087": 2856, "822": 2857, "128": 2858, "281": 2859, "convert": 2860, "floating": 2861, "thereafter": 2862, "471": 2863, "excise": 2864, "976": 2865, "419": 2866, "568": 2867, "589": 2868, "656": 2869, "055": 2870, "426": 2871, "786": 2872, "plan": 2873, "approved": 2874, "grants": 2875, "permits": 2876, "granting": 2877, "appreciation": 2878, "four": 2879, "vesting": 2880, "entitle": 2881, "bonus": 2882, "authority": 2883, "grant": 2884, "310": 2885, "778": 2886, "dates": 2887, "vested": 2888, "45": 2889, "833": 2890, "906": 2891, "421": 2892, "002": 2893, "056": 2894, "recognize": 2895, "unconditional": 2896, "736": 2897, "materials": 2898, "46": 2899, "evaluates": 2900, "ompany": 2901, "consists": 2902, "attributable": 2903, "maker": 2904, "assessing": 2905, "888": 2906, "207": 2907, "143": 2908, "301": 2909, "949": 2910, "nonrecurring": 2911, "573": 2912, "we": 2913, "audited": 2914, "referred": 2915, "our": 2916, "fairly": 2917, "respects": 2918, "oversight": 2919, "pcaob": 2920, "criteria": 2921, "framework": 2922, "committee": 2923, "sponsoring": 2924, "organizations": 2925, "treadway": 2926, "dated": 2927, "november": 2928, "unqualified": 2929, "thereon": 2930, "eon": 2931, "express": 2932, "audits": 2933, "conducted": 2934, "misstatement": 2935, "fraud": 2936, "performing": 2937, "examining": 2938, "test": 2939, "believe": 2940, "matter": 2941, "communicated": 